Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: Few people know about the plan.
hi: योजना के बारे में कुछ ही लोगों को पता है।

source: I'd like to talk to the hotel manager.
hi: मैं होटल मेनेजर से बात करना चाहूंगी.

source: I had a part-time job as a hotel maid, but I didn't like it very much.
hi: में होटेल मे पार्ट-टाइम नौकरानी थी, पर मुज़े वो पसंद नहीं था

source: I gave up smoking for a year.
hi: मैंने एक साल के लिए सिगरेट पीना छोड़ दिया था।

source: Me, I prefer coffee to tea.
hi: मुझे तो चाय से ज़्यादा कॉफ़ी पसंद है।

source: Please throw the ball.
hi: गेंद फेंकिए।

source: The paint hasn't dried yet.
hi: पेंट अभी तक सूखा नहीं है।

source: No sooner had Helen come home than she fell sick.
hi: हेलेन घर आते ही बीमार पड़ गई।

source: Bern is the capital of Switzerland.
hi: बर्न स्विजरलैंड की राजधानी है।

source: It is dangerous to ride a motorbike without a helmet.
hi: हेलमेट पहने बिना मोटरसाईकल चलाना बहुत खतरनाक होता है।

source: Some snakes are poisonous.
hi: कुछ सांप ज़हरीले होते हैं।

source: Could you send someone up to make the bed?
hi: आप किसी को बिस्तर बनाने के लिए भेज सकते हैं क्या?

source: Get out of bed!
hi: बिस्तर से बाहर निकलो!

source: Come and join us.
hi: आओ हमारे साथ बैठो।

source: French is her mother tongue.
hi: फ़्रांसीसी उसकी मातृ भाषा है।

source: The French word 'chat' means 'cat'.
hi: 'शा' इस फ्रांसीसी शब्द का मतलब है 'बिल्ली'।

source: I was ill at ease because I didn't speak French.
hi: मैं परेशान था क्योंकि मुझे फ़्रांसीसी बोलनी नहीं आती थी।

source: France is in western Europe.
hi: फ़्रान्स पश्चिमी यूरोप में है।

source: What's the total population of France?
hi: फ़्रांस की कुल जनसंख्या कितनी है?

source: The swing is moving up and down.
hi: झूला ऊपर नीचे हो रहा है।

source: I'd like a Bloody Mary.
hi: मुझे एक ब्लडी मेरी चाहिए।

source: Football is my favorite game.
hi: फ़ुटबॉल मेरा सबसे पसंदीता खेल है।

source: I'll buy a Ford.
hi: मैं एक फोर्ड की गाड़ी खरीदूंगा।

source: We ordered pink, but we received blue.
hi: हमने पिंक रंग वाले का ऑर्डर किया था पर हमे नीले रंग वाला मिला।

source: Bill resembles his father in character.
hi: बिल चरित्र में अपने पिता से मिलता-जुलता है।

source: Bill lives near the sea.
hi: बिल समुंदर के पास रहता है।

source: Bill did not commit the crime.
hi: बिल ने अपराध नहीं किया था।

source: Bill is honest all the time.
hi: बिल हमेशा ईमानदार होता है।

source: How do you like living on your own?
hi: तुम्हे अकेले रहना अच्छा लगता है क्या?

source: Hitler invaded Poland in 1939.
hi: हिटलर ने १९३९ में पोलैंड में धावा किया।

source: Picasso is a famous artist.
hi: पिकासो एक बहुत प्रसिद्ध कलाकार है।

source: Will you sing me a Beatles' song?
hi: तुम मेरे लिए एक बीटल्स का गाना गा सकते हो क्या?

source: Peter and I would often go to the movies.
hi: पीटर और मैं अक्सर सिनेमा जाते थे.

source: On what kind of bread?
hi: किस तरह की ब्रेड पर?

source: Paris is the capital of France.
hi: पैरिस फ़्रांस की राजधानी है।

source: Pat stripped off his clothes and dived in.
hi: पॅट ने अपने कपड़े उतार दिये और ग़ोता लगाया।

source: My bag was stolen.
hi: मेरा बस्ता चोरी हो गया था।

source: One of my bags is missing.
hi: मेरी एक अटैची ग़ायब है।

source: Butter and cheese are made from milk.
hi: मक्खन और पनीर दूध से बनते हैं।

source: May I see your passport, please?
hi: मैं आपका पासपोर्ट देख सकता हूँ क्या?

source: The bus hasn't come yet.
hi: बस अभी तक आई नहीं है।

source: The bus leaves every ten minutes.
hi: बस हर दस मिनिटों में जाती है।

source: I'll bring one more towel.
hi: मैं एक और तौलिया लाती हूँ।

source: Stand the ladder against the wall.
hi: सीढ़ी को दीवार के साथ खड़ा करो।

source: Don't be absurd.
hi: पागल मत बनो।

source: Yes, I like it very much.
hi: हाँ, मुझे यह बहुत पसंद है।

source: Whoever wants to come to my party may come.
hi: मेरी पार्टी में जो भी आना चाहता है आ सकता है।

source: Can you come to the party?
hi: तुम पार्टी में आ सकते हो क्या?

source: I don't see any point in going if the party is almost over.
hi: मुझे जाने मेँ कोई तुक नहिं लगता अगर पीृतिभोज लगभग समापत हो चुका हो ।

source: I can't put up with that noise any longer.
hi: मैं इस शोर को और बर्दाश्त नहीं कर सकता।

source: I'll call you back later.
hi: मैं तुम्हें थोड़ी देर में फ़ोन करूँगा।

source: It was a mouse.
hi: चूहा था।

source: I was caught in a shower and was drenched to the skin.
hi: मैं बारिश में फंस गया था और तर-तर भीग गया।

source: What time does the train for New York depart?
hi: न्यूयार्क जाने वाली ट्रेन कितने बजे रवाना होती है?

source: New York is a big city.
hi: न्यू यॉर्क बड़ा शहर है।

source: What a big eater!
hi: कितना पेटू है!

source: What a big pumpkin!
hi: कितना बड़ा कद्दू है!

source: What?
hi: क्या?

source: Nancy is afraid of dogs.
hi: नैनसी कुत्तों से डरती है।

source: Clean your lips with the napkin.
hi: अपने होठों को नैपकिन से साफ़ करो।

source: Why did you turn down his offer?
hi: तुमने उसके प्रस्ताव को स्वीकार क्यों नहीं किया?

source: Why did you come early?
hi: तुम इतने जल्दी क्यों आ गए?

source: Why?
hi: क्यों?

source: Because I want to be a translator.
hi: क्योंकि मैं अनुवादक बनना चाहती हूँ।

source: Why were you late this morning?
hi: तुम आज सुबह देर से क्यों आए?

source: Science begins when you ask why and how.
hi: विज्ञान तब शुरू होता है जब तुम "क्यों" और "कैसे" पूछते हो।

source: Please don't hesitate to ask me any questions.
hi: मुझसे कोई भी सवाल पूछने में न हिचकिचाएँ।

source: What kind of work will you do?
hi: तुम किस तरह का काम करोगे?

source: I don't want there to be any misunderstanding.
hi: मैं नहीं चाहता कि कोई भी ग़लतफ़ैमी हो।

source: However hard it may rain, we will start tomorrow.
hi: चाहे जितनी भी ज़ोर से बारिश हो, हम कल निकल चलेंगे।

source: What sports do you like?
hi: तुम्हें कौनसे खेल पसंद है?

source: I will never sell my friend down the river for anything in the world.
hi: मैं दुनिया में किसी भी चीज़ के लिए अपने दोस्त को धोखा नहीं दूँगा।

source: Tom saved her from the fire.
hi: टॉम ने उसे आग से बचा लिया।

source: Tom is able to swim well.
hi: टॉम को अच्छे से तैरना आता है।

source: Tom likes cheese.
hi: टॉम को चीज़ पसंद है।

source: Tom is a friend of mine.
hi: टॉम मेरा एक दोस्त है।

source: Tom and I are friends.
hi: टॉम और मैं दोस्त हैं।

source: It was the window that Tom broke yesterday.
hi: वह वह खिड़की है जिसको टॉम ने कल थोड़ा था।

source: I have no idea to what extent I can trust them.
hi: मुझे नहीं पता मैं उनपर कितना भरोसा कर सकता हूँ।

source: Every country has its own history.
hi: हर एक देश का अपना अपना इतिहास होता है।

source: Every country has its national flag.
hi: हर एक देश का अपना राष्ट्रध्वज होता है।

source: Which dog is yours?
hi: तुम्हारा कुत्ता कौनसा है?

source: Which shoes are you going to put on?
hi: तुम कौनसे जूते पहनोगी?

source: Every house had a garden.
hi: हर घर में बगीचा था।

source: How long have you been abroad?
hi: आप विदेश में कबसे हैं?

source: How long have you waited?
hi: तुम कितनी देर से प्रतीक्षा कर रहे हो?

source: How deep?
hi: कितना गहरा?

source: How soon can you have this dress ready?
hi: इस ड्रेस को कितनी जल्दी तैयार कर सकते हो?

source: Eat and drink.
hi: खाओ और पियो।

source: What is Tony doing?
hi: टोनी क्या कर रहा है?

source: Tony can play tennis very well.
hi: टोनी अच्छी तरह से टेन्निस खेल सकता है.

source: When does Tony study?
hi: टोनी कब पढ़ाई करता है?

source: It was very difficult.
hi: यह बहुत मुश्किल था।

source: It's so cold that the river has frozen over.
hi: इतनी ठंड है के नदी जम गई है।

source: It was so noisy that I couldn't make myself heard.
hi: इतना शोर था कि किसी को भी मेरी आवाज़ सुनाई नहीं दे रही थी।

source: Which book is yours?
hi: तुम्हारी किताब कौनसी है?

source: You may choose whichever you want.
hi: आप जो चाहें चुन सकते हैं.

source: You can buy whichever you like, but not both.
hi: तुम्हें इन में से जो भी पसंद है ख़रीद लो, मगर तुम दोनों नहीं ख़रीद सकते।

source: Take whichever you want.
hi: कोईसा भी ले लो।

source: Say which one you would like.
hi: बोलो तुम्हे कौनसा चाहिए।

source: By the way, have you ever been to Hokkaido?
hi: वैसे, तुम कभी होक्काईदो गई हुई हो क्या?

source: How far are you going?
hi: तुम कितने दूर जा रहे हो?

source: What school do you go to?
hi: तुम कौनसे स्कूल में पढ़ते हो?

source: Where should I pick the tickets up?
hi: मुझे टिकटें कहाँ से लेनीं होंगीं?

source: How is it going?
hi: कैसा चल रहा है?

source: How did you make it?
hi: तुमने कैसे बनाया?

source: How can I meet this quota?
hi: मैं इस कोटे तक भला कैसे पहुंच सकता हूँ?

source: I seem to have a fever.
hi: मुझे बुखार जैसा लगता है।

source: It's not my cup of tea.
hi: मेरे बस की बात नहीं है।

source: You must forgive me.
hi: तुम्हे मुझे माफ़ करना होगा।

source: Please do it quickly.
hi: जल्दी कीजिए।

source: Please turn on the television.
hi: टीवी चालू कीजिए।

source: Sit down, please.
hi: बैठिए।

source: What made her so angry?
hi: उसे इतना गुस्सा कैसे आया?

source: Why is he angry about something like that?
hi: वह इस तरह की बात पर गुस्सा क्यों है?

source: How come you say nothing?
hi: तुम कुछ बोलते क्यों नहीं?

source: How come you made such a mistake?
hi: तुम ऐसी ग़लती कैसे कर बैठे?

source: How can you be so calm?
hi: आप इतने शाँत कैसे हो सकते हैं?

source: What put such an idea into your head?
hi: तुम्हारे दिमाग़ में यह बात कैसे आई?

source: Turn off the light, please.
hi: बत्ती बंद करदो, प्लीज़।

source: Please leave me alone.
hi: मुझे अकेला छोड़ दीजिए।

source: Do come in, please.
hi: कृपया अंदर आईये।

source: What kind of people do you like best?
hi: तुम्हें किस तरह के लोग सबसे ज़्यादा पसंद हैं?

source: Don't leave the door open.
hi: दरवाज़े को खुला मत छोड़ो।

source: Open the door.
hi: दरवाज़ा खोलो।

source: Would you mind my opening the door?
hi: क्या मैं दरवाज़ा खोल सकता हूँ?

source: The instant he opened the door, he smelt something burning.
hi: उसे दरवाज़ा खोलते ही किसी चीज़ के जलने की बदबू सुँघाई दी।

source: Opening the door, I found a stranger standing there.
hi: मैंने जब दरवाज़ा खोला, मुझे एक अजनबी वहाँ खड़ा मिला।

source: There is a boy near the door.
hi: दरवाज़े के पास एक लड़का है।

source: The door was locked and we couldn't get in.
hi: दरवाज़े पर ताला लगा हुआ था और हम अंदर नहीं जा सके।

source: I watch television.
hi: मैं टीवी देखता हूँ।

source: Will you turn on the TV?
hi: टीवी चालू करदोगे क्या?

source: Will you turn on the television?
hi: टीवी चालू कर दोगे क्या?

source: Do you think television does children harm?
hi: क्या आपको लगता है के टेलीविज़न से बच्चों को हानी होती है?

source: Where's the remote control for the TV?
hi: टीवी का रिमोट कहाँ है?

source: According to TV news, there was a plane crash in India.
hi: टीवी समाचार के मुताबिक, भारत में विमान दुर्घटना हुई है।

source: My TV has broken down.
hi: मेरे टीवी का फिरसे भट्टा बैठ गया है।

source: I will ask him about it tomorrow, then.
hi: फिर मैं उससे उसके बारे में कल पूछूँगा।

source: It's fun to play tennis.
hi: टेनिस खेलने में मज़ा आता है।

source: Playing tennis is easy for me.
hi: मेरे लिए टेनिस खेलना बहुत आसान है।

source: "Let's play tennis." "Yes let's."
hi: "चलो टेनिस खेलने चलतें हैं।" "हाँ, चलो चलतें हैं"

source: Ann is second to none in tennis.
hi: टेनिस में अॅन किसी से कम नहीं।

source: Climb to the top.
hi: ऊपर तक चढ़ जाओ।

source: I will help you as far as I can.
hi: मैं तुम्हारा जितना हो सकेगा उतना मदद करूँगा।

source: I'll wait here until my medicine is ready.
hi: जब तक मेरी दवाई तैयार नहीं होती मैं यहीं इंतेज़ार करूंगी।

source: Let's go and see as many things as we can.
hi: चलो चलें, जितनी सारी चीज़ें देख सकते हैं देख आएँ।

source: Try to jump as high as possible.
hi: जितना ऊँचा कूद सकते हो कूदो।

source: There is a book on the table.
hi: मेज़ पर पुस्तक है.

source: There is a flower on the table.
hi: मेज़ पर एक फूल है।

source: It's under the table.
hi: मेज़ के नीचे है।

source: Tim is the black sheep of the Jones' family.
hi: जोन्स परिवार के नाम पर जो काला धब्बा है वह टिम है।

source: Dick promised to come back by three o'clock.
hi: डिक ने वादा किया कि वह तीन बजे से पहले वापस आ जाएगा।

source: Dick says, "I can swim."
hi: डिक कहता है "मैं तैर सकता हूँ।"

source: At last, he realized his mistakes.
hi: आखिरकार उसको उसकी ग़लतियाँ समझ में आईं।

source: At last, he solved the question.
hi: उसने आखिरकार सवाल का जवाब ढूँढ निकाला।

source: At last, we got to the lake.
hi: हम आखिरकार झील तक पहुँच गए।

source: Sorry...
hi: माफ़ कीजिये

source: I feel like taking a rest.
hi: मुझे थोड़ा आराम करने का मन है।

source: Turn to channel 1.
hi: चैनल 1 पर जाओ.

source: Charlie was a mere child when I saw him last.
hi: मैंने पिछली बार जब चार्ली को देखा था वह एक छोटा सा बच्चा था।

source: Do you have any tickets left?
hi: तुम्हारे पास टिकटें बचीं हैं क्या?

source: It was getting dark.
hi: अंधेरा हो रहा था.

source: No one can help me.
hi: कोई मेरी मदद नहीं कर सकता।

source: It seems that everybody likes golf.
hi: ऐसा लगता है जैसे कि सभी लोगों को गौल्फ़ अच्छा लगता है।

source: Tell whoever comes that I'm out.
hi: अगर कोई आए तो उनसे कहना कि मैं बाहर गया हूँ।

source: I'll arrange for someone to pick you up at your home.
hi: मैं किसी को तुम्हें घर से लेने के लिए भिजवादूँगा।

source: Would you mind if I smoke?
hi: मेरे सिगरेट पीने पर आपको आपत्ति तो नहीं होगी?

source: Stop smoking.
hi: धूम्रपान करना बंद कर।

source: Smoking is dangerous to health.
hi: धूम्रपान सेहत के लिए हानिकारक होता है।

source: There are few, if any, such men.
hi: ऐसे लोग कम ही होंगे।

source: You can have this book for nothing.
hi: तुम यह किताब मुफ़्त में ले सकते हो।

source: I want you to go to Osaka at once.
hi: फ़ौरन ओसाका जाओ।

source: Indeed he is rich, but he is not reliable.
hi: वह पैसेवाला तो है, पर भरोसेमंद नहीं है।

source: Flying a kite can be dangerous.
hi: पतंग उड़ाना खतरनाक हो सकता है।

source: The kite got caught in the tree.
hi: पतंग पेड़ में जाकर अटक गई।

source: I tried to tell you.
hi: मैंने तुम्हे बताने की कोशिश करी थी।

source: Now stop crying.
hi: बस अब रोना बंद करो।

source: Imagine that you have a time machine.
hi: सोचो कि तुम्हारे पास एक टाइम मशीन है।

source: Most people like watching TV.
hi: ज़्यादातर लोगों को टीवी देखना अच्छा लगता है।

source: About how much will it cost?
hi: लगभग कितनी कीमत का है?

source: It's almost six o'clock.
hi: छः बजने वाले हैं।

source: Hotshot!
hi: दक्ष!

source: I can't buy a book this expensive.
hi: मैं इतनी महंगी किताब नहीं ख़रीद सकता।

source: Such a thing cannot be found everywhere.
hi: ऐसी चीज़ हर कहीं नहीं मिलती है।

source: You've got a nerve to say such a thing!
hi: तुम्हारी जुर्रत कैसे हुई यह बोलने की?!

source: It is no use worrying about it.
hi: इसके बारे में चिंता करने से कोई फ़ायदा नहीं है।

source: Drink it down.
hi: पीकर खतम करदो।

source: I sold it for ten dollars.
hi: मैंने उसे दस डॉलर के लिए बेच दिया।

source: It's for a friend of mine.
hi: यह मेरे दोस्त के लिए है।

source: That was cooked in oil.
hi: वह तेल में पकाया गया है।

source: That is out of the question.
hi: उसका तो सवाल ही नहीं उठता।

source: That's really a great idea.
hi: यह तो बहुत ही अच्छा सुझाव है।

source: It is a book.
hi: यह किताब है।

source: I want to do it myself.
hi: मैं अपने-आप करना चाहता हूँ।

source: It was too difficult for me.
hi: वह मेरे लिए बहुत कठिन था।

source: It's an answer to her letter.
hi: यह उसकी चिट्ठी का जवाब है।

source: That's his specialty.
hi: वह उसकी ख़ासियत है।

source: That applies to him too.
hi: यह उसपर भी लागु होता है।

source: It happened between eight and ten.
hi: आठ से दस बजे के बीच हुआ।

source: It is a difficult problem.
hi: यह समस्या बहुत कठिन है।

source: It's the same for everyone.
hi: सब लोगों के लिए एक समान है।

source: That's a completely unfounded rumor.
hi: वह अफ़वाह पूरी तरह से बेबुनयाद है।

source: It is a sheer waste of time.
hi: यह सरासर समय की बर्बादी है।

source: It is a task beyond my power.
hi: यह काम मेरे बस के बाहर है।

source: Is it not black?
hi: क्या यह काला नहीं है?

source: What an easy problem it is!
hi: यह कितनी आसन समस्या है।

source: It is not far away from the hotel.
hi: वह होटल से दूर नहीं है.

source: I had bought it the week before.
hi: मैंने उसे पिछले हफ्ते ख़रीदा था.

source: When does it begin?
hi: शुरू कब होता है?

source: That's too small to fit on your head.
hi: वह तुम्हारे सर के लिए बहुत छोटा है।

source: I meant it as a joke.
hi: मैंने तो मज़ाक के तौर पर कहा था।

source: Its color is red.
hi: इसका रंग लाल है|

source: Well, I must be going.
hi: मुझे चलना चाहिए।

source: They won't believe me even if I swear it is true.
hi: वे मेरा विश्वास नहीं करेंगे चाहे मैं कसम भी क्यों न खालूँ।

source: I'll let you know when it has been decided.
hi: वो तए किये जाने पर मैं तुम्हे बता दूंगा।

source: Let me try it.
hi: मुझे दिखाओ।

source: Do you have any soft drinks?
hi: तुम्हारे पास कोक-शोक है क्या?

source: The old lady smiled at her granddaughter.
hi: बूढ़ी औरत अपनी पोती पर मुस्कुराई।

source: The old man sat in the chair with his eyes closed.
hi: वह बूढ़ा आदमी आँखें बंद करके कुरसी में बैठा था।

source: How fast the train is running!
hi: देखो रेलगाड़ी कितनी तेज़ी से चल रही है!

source: I hurried so as not to miss the train.
hi: मैंने जल्दी करी जिससे कि ट्रेन न छूट जाए।

source: The storm destroyed the whole town.
hi: तूफ़ान ने पूरे नगर को नष्ट कर दिया।

source: The next day Jesus decided to leave for Galilee.
hi: अगले दिन यीशु ने गलील जाने का फ़ैसला लिया।

source: Such a thing occurs frequently.
hi: ऐसा अक्सर होता है।

source: The medicine tastes bitter.
hi: इस दवाई का स्वाद बहुत कड़वा है।

source: A committee has been set up to investigate the problem.
hi: इस समस्या की तहकीकात करने के लिए एक समिति स्थापित करी गई है।

source: The question was much discussed.
hi: इस सवाल पर बहुत बात-चीत हुई थी।

source: The problem is being discussed now.
hi: समस्या पर बहस जारी है।

source: I have nothing to say with regard to that problem.
hi: मुझे इस विषय पर कुछ नहीं कहना है।

source: They are discussing the problem.
hi: वे इस समस्या के बारे में बातचीत कर रहे हैं।

source: The good news brought tears to her eyes.
hi: वह खुशखबरी मेरी आँखों में आँसू ले आई।

source: There is no hurry about returning the book to me.
hi: मुझे वह किताब लौटाने में जल्द-बाज़ी करने की ज़रूरत नहीं है।

source: Where is the book?
hi: वह किताब कहाँ है?

source: They have demanded that all copies of the book be destroyed.
hi: उन्होंने मांग करी है कि इस किताब की सारी कॉपियाँ नष्ट कर दीं जाएं।

source: The law kept people from playing football for a while.
hi: क़ानून ने लोगों को फ़ुटबॉल खेलने से बहुत देर तक रोका।

source: The soldier gave water to me.
hi: सैनिक ने मुझे पानी दिया।

source: That dress becomes her very well.
hi: वह ड्रेस उसपर बहुत जचती है।

source: The room has been empty for a long time.
hi: यह कमरा काफ़ी देर से खाली रहा है।

source: I promised not to breathe a word of the secret.
hi: मैंने वादा किया था कि इस राज़ के बारे में किसी को कुछ नहीं बताऊँगा।

source: Let me relieve you of that case. It looks heavy.
hi: लाओ मैं इस बक्से को उठाने में तुम्हारी मदद करूँ. यह भार लगता है.

source: The box is made of wood.
hi: डब्बा लकड़ी का बना है।

source: That is too small a box to hold all these things.
hi: वह डब्बा बहुत छोटा है, उसमें इतना सारा सामान नहीं आएगा।

source: The box was so heavy I could not move it.
hi: डब्बा इतना भारी था कि मैं उसे हिला नहीं सका।

source: The museum is open from Monday to Friday.
hi: म्युज़ियम सोमवार से शुक्रवार तक खुला रहता है।

source: The old farmer did not pay him much money.
hi: वह बूढ़ा किसान उसको बहुत पैसे नहीं देता था।

source: The cat slowly approached the mouse.
hi: बिल्ली धीरे से चूहे की तरफ़ बढ़ी।

source: It was cold that day, and moreover it began to rain.
hi: उस दिन ठंड थी, और ऊपर से बारिश होने लगी।

source: The weather varies from day to day.
hi: मौसम दिन-ब-दिन बदलता है।

source: On that day, Japanese flags were flying.
hi: उस दिन, जापानी झंडे लहरा रहे थे।

source: All the meat was bad.
hi: सभी मांस खराब था।

source: The road is parallel to the river.
hi: वह सड़क नदी के साथ साथ चलती है।

source: In those days, I went to bed earlier.
hi: उन दिनों में मैं (रात में) जल्दी से सो जाया करता था।

source: Few people live on the island.
hi: इस द्वीप पर बहुत कम लोग रहते हैं।

source: The store is not open today.
hi: दुकान आज बंद है।

source: The shop carried leather goods.
hi: वह दुकान चमड़े के उत्पाद बेचती थी।

source: The investigation is under way.
hi: जाँच-पड़ताल जारी है।

source: The town lay buried for centuries.
hi: वह नगर सदियों तक दफ़न रहा।

source: That town is two miles away.
hi: वह नगर दो मील दूर है।

source: Which is the best hotel in the town?
hi: शहर में सबसे अच्छा होटल कौन सा है?

source: The news caused alarm throughout the village.
hi: उस खबर ने गाँव में दहशत फैला दी।

source: The man hit me on the head.
hi: उस आदमी ने मुझे सर पर मारा।

source: The man committed murder.
hi: उस आदमी ने कत्ल किया।

source: The man was sitting on a fallen tree.
hi: वह आदमी एक गिरे हुए पेड़ पर बैठा था।

source: The man lost all hope.
hi: उस आदमी ने सारी उम्मीद छोड़दी।

source: The man looked at me.
hi: उस आदमी ने मेरी ओर देखा।

source: I am not sure how to pronounce the word.
hi: मुझे ठीक से नहीं पता इस शब्द को कैसे पढ़ा जाता है।

source: The village lies 20 miles north of this town.
hi: गांव इस नगर से २० मील उत्तर की ओर स्थित है।

source: The ship is bound for Finland.
hi: यह जहाज़ फ़िनलैंड के लिए रवाना है।

source: The ship is at sea for India.
hi: जहाज़ समुंदर में है और भारत के लिए रवाना है।

source: As a result of the war, many people died.
hi: जंग की वजह से बहुत सारे लोग मर गए।

source: The river flows between the two countries.
hi: नदी उन दोनों देशों के बीच से बहती है।

source: The baby fell asleep in the cradle.
hi: बच्चा पालनी में सो गया।

source: The baby woke up in the middle of the night.
hi: बच्चा की नींद आधी रात में खुल गई।

source: Covered with dust, the doll stood in the corner of the room.
hi: वह धूल से लिपटी हुई गुड़िया कमरे के कोने में खड़ी हुई थी।

source: Those people appreciate clarity.
hi: वोह लोग सरलता को मानते हैं.

source: The gentleman is a very famous pianist.
hi: यह महाशय बहुत जाने-माने पियानिस्ट हैं।

source: The animals in the forest died off.
hi: जंगल के जानवर मर गए।

source: Please give me the paper when you have done with it.
hi: जब आपने अखबार पढ़ लिया हो तो मुझे दे दीजिएगा।

source: The food was not fit for man or beast.
hi: वह खाना न तो आदमी न जानवर को खिलाने लायक था।

source: In that case, call the police.
hi: अगर ऐसी बात है तो मैं पुलिस को फ़ोन मिलाता हूँ।

source: The boy ran toward his house.
hi: लड़का अपने घर की तरफ भागा।

source: The boy has an apple in his pocket.
hi: इस लड़के के जेब में एक सेव है।

source: The boy cannot have stolen my umbrella.
hi: यह लड़का मेरा छाता नहीं चुरा सकता था।

source: The girl did nothing but cry.
hi: उस लड़की ने रोने के अलावा और कुछ नहीं किया।

source: The novel is centered on the Civil War.
hi: यह उपन्यास सिविल वॉर के बारे में है।

source: Who is the author of the novel?
hi: इस उपन्यास का लेखक कौन है?

source: The girl entered the room.
hi: लड़की ने कमरे में प्रवेश किया.

source: The prisoner was released.
hi: क़ैदी को रिहा कर दिया गया।

source: Who was the letter written to?
hi: पत्र किसको लिखा गया था?

source: The letter does not say what time she will come up to Tokyo.
hi: पत्र में यह नहीं लिखा के वह टोक्यो कब आएगी ।

source: The car is ready.
hi: गाड़ी तैयार है।

source: The car is exceeding the speed limit.
hi: यह गाड़ी गति सीमा से तेज़ चल रही है।

source: That bicycle is too small for you.
hi: यह साईकल तुम्हारे लिए बहुत छोटी है।

source: The accident was due to his careless driving.
hi: वह ऐक्सीडेंट उसकी लापरवाही की वजह से हुआ।

source: When did the accident happen?
hi: हादसा कब हुआ?

source: The passengers who were injured in the accident were taken to the nearest hospital.
hi: जिन यात्रियों को दुर्घटना मे चोट आई थी उन्हे अस्पताल ले जाया गया।

source: Many people were killed in the accident.
hi: दुर्घटना में कई लोग मारे गये।

source: The incident gave a shock to the whole school.
hi: उस दुर्घटना ने पूरे स्कूल को सदमा पहुँचाया।

source: The poet wrote many poems.
hi: उस कवि ने बहुत सारी कविताएं लिखीं थीं।

source: The city lies east of London.
hi: वह शहर लंदन के पूर्व में स्थित है।

source: He is in poor health.
hi: उसकी हालत बुरी है।

source: He got lost in the park.
hi: वह पार्क में खो गया।
